select * from "Ученый";
select * from "Ученый_отрасль";
select * from "Ученый_организация";
select * from "Отрасль_науки";
select * from "Организация";
select * from "Общий_список_участия";

insert into "Ученый"("Фамилия", "Имя", "Отчество", "Город")
    values ('Петров', 'Александр', 'Петрович', 'Москва');
insert into "Ученый_организация"("Идентификатор_ученого", "Идентификатор_организации")
    values (18, 1);
insert into "Ученый_отрасль"("Идентификатор_ученого", "Идентификатор_отрасли")
    values (18, 1);
insert into "Отрасль_науки"("Название") values ('Игровые');

update "Ученый" set "Город" = 'Ижевск' where "Фамилия" = 'Петров'
    and "Имя" = 'Александр' and "Отчество" = 'Петрович';
update "Ученый_организация" set "Идентификатор_организации" = 2
                            where "Идентификатор_ученого" = 18;
update "Ученый_отрасль" set "Идентификатор_отрасли" = '2'
                            where "Идентификатор_ученого" = 18;
update "Отрасль_науки" set "Название" = 'Архитектура'
                            where "Идентификатор" = 1;
update "Организация" set "Название" = 'ООО "Колосс"'
                            where "Идентификатор" = 1;

select * from list_without_doklad;
select * from scientists_employment;
update list_without_doklad set "Подтверждение_участия" = true
where "Идентификатор_ученого" = 7 and "Идентификатор_конференции" = 10;